{
    "labels": {
        "home": "Home",
        "about": "About",
        "english": "英文",
        "chinese": "中文",
        "beginner": "Beginner",
        "advanced": "Major Tutorial",
        "quiz": "Quiz",
        "start": "Start",
        "tutorial": "Tutorial List.",
        "textFieldLabel": "Input here..."
    },
    "home": {
        "intro_1": "Learn the blockchain basics in",
        "intro_2": "BC Amateur.",
        "intro_3": "BC Amateur is an online learning platform providing free tutorials for learning blockchain.",
        "intro_4": "Select tutorial",
        "description_1": "Introducing the blockchain.",
        "description_2": "Learning rationale behind of the blockchain technology with typical Bitcoin-like blockchain example.",
        "description_3": "Challenge yourself with a short quiz."
    },
    "tutorial_1": { 
        "title": "1. Hash Value & Function",
        "subTitle_1": "1.1 TL;DR",
        "subTitle_2": "1.2 Properties",
        "subTitle_3": "1.3 Applicability",
        "paragraph_1_1": "Hash value is generated by a hash function, which is a non-semantic output with a fixed-length. It is just like an ID for that specific input.",
        "paragraph_2_1": "Here is a hash value generator using the hash function SHA256, let's try to input something and check for the hashed result!",
        "paragraph_2_2": "What is your discoveries?",
        "paragraph_2_3": "You may found out that a hash value has the following properties:",
        "paragraph_2_4": "(1) Fixed Length",
        "paragraph_2_4_1": "Hash function will generate a fixed length output, this would not be affected by the input value and the length of the input value. In the above hash function SHA256, it always produce a 256 bits output value. As the output value is represented in hexadecimal form and a hexadecimal digit contains 4 bits, the digit length of the hash function SHA256 output will be 64.",
        "paragraph_2_5": "(2) Collision Resistance",
        "paragraph_2_5_1": "Hash function is resistance against collision, having two identical output values from a hash function like SHA-256 using different inputs is imposible to be found. Two different input will result in two different ouput.",
        "paragraph_2_6": "(3) Same input result in same output",
        "paragraph_2_6_1": "Hash function will guarantee to generate the same output value with the same input value. For example, the hash value(SHA-256) of the word 'Hash' is 'a91069147f9bd9245cdacaef8ead4c3578ed44f179d7eb6bd4690e62ba4658f2'. When using the same hash function, the output value of a specific input is constant.",
        "paragraph_2_7": "(4) Hiding",
        "paragraph_2_7_1": "Hash function will generate an output which does not contain any trail of the original input values, it is impossible to figure out the input value using the output hash value because a hash function does not generate value simply by replacing the alphabet.",
        "paragraph_3_1": "A Blockchain system applies Hash in different parts, the major parts are as follows.",
        "paragraph_3_2": "(1) Chaining the blocks",
        "paragraph_3_3": "(2) The Merkle Tree",
        "paragraph_3_4": "More will be explained in other chapters.",
        "hash_value": "The hash value of your input is: "
    },
    "tutorial_2": {
        "title": "2. Blockchain Basic Structure",
        "header_1": "Nonce",
        "header_2": "Difficulty",
        "header_3": "Version",
        "header_4": "Merkle Root Hash",
        "header_5": "Timestamp",
        "header_6": "Previous Block Hash",
        "correct": "Correct!",
        "incorrect": "Incorrect",
        "subTitle_1": "1.1 TL;DR",
        "subTitle_2": "1.3 Block Header",
        "subTitle_3": "1.2 Block Body",
        "paragraph_1_1": "Blockchain can usually be divided by the header part and other body parts. For the elements in the header, one example is that the Previous Block Hash in the header, it plays the key role to chain the data block into a blockchain.",
        "paragraph_2_1": "Here is a single block with different elements, could you try to identify the correct elements in the header?",
        "paragraph_2_2": "Details of the block header elements usually:",
        "paragraph_2_3": "(1) Difficulty",
        "paragraph_2_3_1": "Difficulty is used to verify the blocks. In Bitcoin, difficulty is used in the Proof of Work algorithm for mining new blocks.",
        "paragraph_2_4": "(2) Merkle Root Hash",
        "paragraph_2_4_1": "",
        "paragraph_2_5": "(3) Nonce",
        "paragraph_2_5_1": "",
        "paragraph_2_6": "(4) Previous Block Hash",
        "paragraph_2_6_1": "",
        "paragraph_2_7": "(5) Timestamp",
        "paragraph_2_7_1": "",
        "paragraph_2_8": "(6) Version",
        "paragraph_2_8_1": "",
        "paragraph_3_1": "Details of the block body elements usually:",
        "paragraph_3_2": "(1) Block Size, the size of the block in bytes.",
        "paragraph_3_3": "(2) Block Header, it included several elements which will be mentioned below.",
        "paragraph_3_4": "(3) Transation Counter, the total amount of the transations in the block.",
        "paragraph_3_5": "(3) Transations, all processed transations data in the block."
    },
    "tutorial_3": {
        "title": "3. Block Generation & Mining"
    },
    "tutorial_4": {
        "title": "4. Blockchain Transation"
    },
    "tutorial_5": {
        "title": "5. Merkle Tree"
    },
    "tutorial_6": {
        "title": "6. Double Spending Problem"
    },
    "tutorial_7": {
        "title": "7. 51% Attack Problem"
    }
}